def f23(t):
    tmp =[[row[i] for row in t] for i in range(len(t[0]))]
    line_2 = []
    line_3 = []

    
    for i in range(len(tmp)):
        if(str(type(tmp[i][0])) == '<class \'NoneType\'>'):
            noneIndex = i
            break
    
    for i in range(len(tmp)):
        for j in range(i+1, len(tmp)):
            if(tmp[i] == tmp[j]):
                del tmp[j]
                
    for i in range(len(tmp)):
        if(str(tmp[i][0])[1] == '.'):
            for k in range(len(tmp[i])):
                tmp[i][k]=tmp[i][k]
                if(tmp[i][k] == '0.0'):
                    tmp[i][k] = '0%'
                else:
                    tmp[i][k] = str(int(float(tmp[i][k])*100))+'%'
        
    for i in range(len(tmp)):
        if(str(tmp[i][0])[0] == chr(43)):
            print('>>', tmp)
            for k in range(len(tmp[i])):
                tmp[i][k] = tmp[i][k].split('#')
                
                line_3.append(tmp[i][k][0][5:])
                if(tmp[i][k][1] == "Выполнено"):                    
                    tmp[noneIndex][k] = '1'
                else:
                    tmp[noneIndex][k] = '0'
            tmp[i] = line_3
        print('>>', tmp)

    tmp[1], tmp[2] = tmp[2], tmp[1]
    tmp2 =[[row[i] for row in tmp] for i in range(len(tmp[0]))]
    print('>>', tmp2)
    tmp2.sort(key=lambda i: i[2])
    print('>>', tmp2)
    final = [[row[i] for row in tmp2] for i in range(len(tmp2[0]))]

    return final



            

lst = [[None, '+71302102596#Не выполнено', '1.0', '1.0'],
[None, '+72566206183#Выполнено', '0.8', '0.8'],
[None, '+74877529394#Выполнено', '0.2', '0.2']]

print(f23(lst))



'''

split('#')



f23:
[

([[None, '+76835370721#Не выполнено', '0.0', '0.0'],
[None, '+75749832391#Не выполнено', '0.1', '0.1'],
[None, '+73175138328#Выполнено', '0.7', '0.7']],

[['1', '0', '0'],
['70%', '0%', '10%'],
['5138328', '5370721', '9832391']]),


([[None, '+71302102596#Не выполнено', '1.0', '1.0'],
[None, '+72566206183#Выполнено', '0.8', '0.8'],
[None, '+74877529394#Выполнено', '0.2', '0.2']],

[['0', '1', '1'],
['100%', '80%', '20%'],
['2102596', '6206183', '7529394']]),


([[None, '+71897278008#Выполнено', '0.8', '0.8'],
[None, '+79984166959#Не выполнено', '0.0', '0.0'],
[None, '+76171285577#Не выполнено', '0.8', '0.8'],
[None, '+75728515185#Не выполнено', '0.2', '0.2']],

[['0', '0', '1', '0'],
['80%', '0%', '80%', '20%'],
['1285577', '4166959', '7278008', '8515185']]),


([[None, '+79314893896#Не выполнено', '0.6', '0.6'],
[None, '+70369246836#Выполнено', '0.0', '0.0'],
[None, '+73420064430#Выполнено', '0.1', '0.1']],

[['1', '0', '1'],
['10%', '60%', '0%'],
['0064430', '4893896', '9246836']]),


([[None, '+76181931843#Выполнено', '0.6', '0.6'],
[None, '+71890521496#Выполнено', '0.8', '0.8'],
[None, '+79285318533#Выполнено', '0.6', '0.6'],
[None, '+72101818043#Выполнено', '0.5', '0.5']],

[['1', '1', '1', '1'],
['80%', '50%', '60%', '60%'],
['0521496', '1818043', '1931843', '5318533']]),


([[None, '+74234063552#Не выполнено', '0.9', '0.9'],
[None, '+76435454405#Выполнено', '0.0', '0.0'],
[None, '+76937032772#Выполнено', '0.8', '0.8'],
[None, '+73190640639#Выполнено', '0.4', '0.4']],

[['1', '0', '1', '1'],
['40%', '90%', '0%', '80%'],
['0640639', '4063552', '5454405', '7032772']]),


([[None, '+79127342807#Выполнено', '0.0', '0.0'],
[None, '+76854196470#Не выполнено', '0.1', '0.1'],
[None, '+77133688212#Не выполнено', '0.0', '0.0'],
[None, '+72875240236#Выполнено', '0.9', '0.9']],

[['0', '0', '1', '1'],
['0%', '10%', '90%', '0%'],
['3688212', '4196470', '5240236', '7342807']]),


([[None, '+75404927058#Не выполнено', '0.6', '0.6'],
[None, '+79196387853#Выполнено', '0.1', '0.1'],
[None, '+76972711768#Выполнено', '0.4', '0.4']],

[['1', '0', '1'],
['40%', '60%', '10%'],
['2711768', '4927058', '6387853']])

]

'''
